<?php
//╔════════════════════════════════════════════════════╗
//║        DO NOT REMOVE OR CHANGE THIS SECTION        ║
//║                                                    ║
//║Filename : ships.php                                ║
//║Version  : 0.1                                      ║
//║Author   : Prince 3                                 ║
//║E-MAIL   : khatibe_30@hotmail.fr                    ║
//║Copyright: Ikariama(c) 2010. All rights reserved.   ║
//╚════════════════════════════════════════════════════╝
?>
<?php
$s210=array("name"=>"سفينة مزودة بقوة دفع","desc"=>"تعتبر هذه السفينة المزودة بمنقار مثبت على رأسها، من السفن الحربية الكلاسيكية لسلاح البحرية. يعمد العديد من البحارة فيها بالتجذيف بقوة وبسرعة هائلة لإصابة جذع السفينة العدو بقوة دافعة كبيرة. عادة تكون ضربة مثل هذه كافية لإغراق سفينة العدو.","wood"=>220,"sulfur"=>0,"crystal"=>0,"wine"=>0,"citizens"=>5,"upkeep"=>40,"weight"=>1,"sylevel"=>1,"time"=>2400,"attack"=>120,"armor"=>6,"speed"=>30,"size"=>1,"damage1"=>72,"damage2"=>0,"ammo"=>0);
$s211=array("name"=>"سفينة اللهب","desc"=>"في رأس سفينة اللهب يوجد قاذف لهب، يقذف اللهب الإغريقي من فوق البحر. مزيج مادة تلتهب وتحترق حتى فوق سطح البحر مكونة بذلك بساطاً من اللهب، يزرع الخوف والهرع في الأعداء. هذا يجعل من هذه السفينة سلاحا مخيفاً للقتال عن قرب.","wood"=>80,"sulfur"=>230,"crystal"=>0,"wine"=>0,"citizens"=>4,"upkeep"=>30,"weight"=>1,"sylevel"=>4,"time"=>1800,"attack"=>110,"armor"=>3,"speed"=>40,"size"=>1,"damage1"=>98,"damage2"=>0,"ammo"=>0);
$s215=array("name"=>"سفينة هاون","desc"=>"للسفينة المزودة بهاون جذع عريض يزودها بقوة أكبر لصد مياه البحر، لمقاومة قوة ارتداد ضربات قذيفة الهاون. إذا تم حساب زاوية القذيفة بشكل دقيق فإنها تصيب جذع السفينة العدو بانفجار قوي.","wood"=>220,"sulfur"=>900,"crystal"=>0,"wine"=>0,"citizens"=>5,"upkeep"=>130,"weight"=>1,"sylevel"=>6,"time"=>3000,"attack"=>56,"armor"=>2,"speed"=>20,"size"=>1,"damage1"=>34,"damage2"=>66,"ammo"=>3);
$s213=array("name"=>"سفينة حاملة لسلاح المرجام","desc"=>"تحتوي هذه السفينة على نشاب ضخم، وضع أصلاً لرماية المرساة. غير أنه من الممكن استعماله رغم صغر الثقب التي يسببها كسلاح ذي تصويب عالٍ ودقيق للقتال عن بعد ولإصابة العدو تحت مستوى سطح الماء.","wood"=>180,"sulfur"=>160,"crystal"=>0,"wine"=>0,"citizens"=>6,"upkeep"=>45,"weight"=>1,"sylevel"=>2,"time"=>3000,"attack"=>132,"armor"=>4,"speed"=>30,"size"=>1,"damage1"=>48,"damage2"=>28,"ammo"=>5);
$s214=array("name"=>"سفينة مزودة بمنجنيق","desc"=>"حجم المنجنيق المركب على هذه السفينة صغير بالمقارنة مع قرينه في البر، وذلك نظراً لضيق المساحة المتوفرة على السفينة. كما أنه أقل دقة فيما يخص التصويب بسبب أمواج البحر. الجميل فيه هو أنه يحمل أقداراً تحتوي على كمية من الزيت المحترق، تترك عند رميها بساطاً من الزيت فوق الماء، يشكل خطراً كبيراً على سفن الأعداء.","wood"=>180,"sulfur"=>140,"crystal"=>0,"wine"=>0,"citizens"=>5,"upkeep"=>50,"weight"=>1,"sylevel"=>3,"time"=>3000,"attack"=>86,"armor"=>0,"speed"=>30,"size"=>1,"damage1"=>28,"damage2"=>37,"ammo"=>5);
$s212=array("name"=>"غواصة","desc"=>"تعد السفن القادرة على الغوص أقوى سلاح يمكن استخدامه في أعالي البحار. لن تتمكن السفن الحربية من إصابتها بضرر أو مقاومة هجومها، إلا في حالة استخدام غواصات مماثلة خاصة بها","wood"=>160,"sulfur"=>0,"crystal"=>750,"wine"=>0,"citizens"=>6,"upkeep"=>70,"weight"=>1,"sylevel"=>7,"time"=>3600,"attack"=>47,"armor"=>3,"speed"=>40,"size"=>1,"damage1"=>48,"damage2"=>0,"ammo"=>0);
$s216=array("name"=>"جارفة آلية ضخمة","desc"=>"اختراع أصاب حتى هيرون بالدهشة: تقوم الجارفة الآلية الضخمة باستخدام قوة دفع الآلة البخارية وعجلات الجارفة لكي تتحرك في اتجاه العدو بقوة وسرعة كبيرة من أجل الاصطدام به. تحتاج السفينة من أجل هذا إلى عدد قليل من البحارة.","wood"=>300,"sulfur"=>1500,"crystal"=>0,"wine"=>0,"citizens"=>2,"upkeep"=>90,"weight"=>1,"sylevel"=>5,"time"=>2400,"attack"=>236,"armor"=>8,"speed"=>30,"size"=>1,"damage1"=>140,"damage2"=>0,"ammo"=>0);

?>